[
    {
        "id": "AI",
        "content": [
            {
                "name": "A review of possible effects of cognitive biases on interpretation of rule-based machine learning models",
                "author": "Tomáš Kliegr, Štěpán Bahník, Johannes Fürnkranz",
                "review-article": "While the interpretability of machine learning models is often equated with their mere syntactic comprehensibility, we think that interpretability goes beyond that, and that human interpretability should also be investigated from the point of view of cognitive science. The goal of this paper is to discuss to what extent cognitive biases may affect human understanding of interpretable machine learning models, in particular of logical rules discovered from data. Twenty cognitive biases are covered, as are possible debiasing techniques that can be adopted by designers of machine learning algorithms and software. Our review transfers results obtained in cognitive psychology to the domain of machine learning, aiming to bridge the current gap between these two areas. It needs to be followed by empirical studies specifically focused on the machine learning domain.",
                "lastest-update": "June 2021",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S0004370221000096",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S0004370221000096/pdfft?md5=67b3a0c5e6c59bd6167b0e6d9e584f3f&pid=1-s2.0-S0004370221000096-main.pdf"
            },
            {
                "name": "Hard choices in artificial intelligence",
                "author": "Roel Dobbe, Thomas Krendl Gilbert, Yonatan Mintz",
                "review-article": "As AI systems are integrated into high stakes social domains, researchers now examine how to design and operate them in a safe and ethical manner. However, the criteria for identifying and diagnosing safety risks in complex social contexts remain unclear and contested. In this paper, we examine the vagueness in debates about the safety and ethical behavior of AI systems. We show how this vagueness cannot be resolved through mathematical formalism alone, instead requiring deliberation about the politics of development as well as the context of deployment. Drawing from a new sociotechnical lexicon, we redefine vagueness in terms of distinct design challenges at key stages in AI system development. The resulting framework of Hard Choices in Artificial Intelligence (HCAI) empowers developers by 1) identifying points of overlap between design decisions and major sociotechnical challenges; 2) motivating the creation of stakeholder feedback channels so that safety issues can be exhaustively addressed. As such, HCAI contributes to a timely debate about the status of AI development in democratic societies, arguing that deliberation should be the goal of AI Safety, not just the procedure by which it is ensured.",
                "lastest-update": "November 2021",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S0004370221001065",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S0004370221001065/pdfft?md5=8c907c74fdf709f74276185836b57598&pid=1-s2.0-S0004370221001065-main.pdf"
            },
            {
                "name": "Making sense of sensory input",
                "author": "Richard Evans, José Hernández-Orallo, Johannes Welbl, Pushmeet Kohli, Marek Sergot",
                "review-article": "This paper attempts to answer a central question in unsupervised learning: what does it mean to “make sense” of a sensory sequence? In our formalization, making sense involves constructing a symbolic causal theory that both explains the sensory sequence and also satisfies a set of unity conditions. The unity conditions insist that the constituents of the causal theory objects, properties, and laws must be integrated into a coherent whole. On our account, making sense of sensory input is a type of program synthesis, but it is unsupervised program synthesis.<br><br>Our second contribution is a computer implementation, the Apperception Engine, that was designed to satisfy the above requirements. Our system is able to produce interpretable human-readable causal theories from very small amounts of data, because of the strong inductive bias provided by the unity conditions. A causal theory produced by our system is able to predict future sensor readings, as well as retrodict earlier readings, and impute (fill in the blanks of) missing sensory readings, in any combination. In fact, it is able to do all three tasks simultaneously.<br><br>We tested the engine in a diverse variety of domains, including cellular automata, rhythms and simple nursery tunes, multi-modal binding problems, occlusion tasks, and sequence induction intelligence tests. In each domain, we test our engine's ability to predict future sensor values, retrodict earlier sensor values, and impute missing sensory data. The Apperception Engine performs well in all these domains, significantly out-performing neural net baselines. We note in particular that in the sequence induction intelligence tests, our system achieved human-level performance. This is notable because our system is not a bespoke system designed specifically to solve intelligence tests, but a general-purpose system that was designed to make sense of any sensory sequence.",
                "lastest-update": "April 2021",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S0004370220301855",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S0004370220301855/pdfft?md5=da7b5b3343a130e065db0c8b888e16a0&pid=1-s2.0-S0004370220301855-main.pdf"
            },
            {
                "name": "Making sense of raw input",
                "author": "Richard Evans, Matko Bošnjak, Lars Buesing, Kevin Ellis, David Pfau, Pushmeet Kohli, Marek Sergot",
                "review-article": "How should a machine intelligence perform unsupervised structure discovery over streams of sensory input? One approach to this problem is to cast it as an apperception task. Here, the task is to construct an explicit interpretable theory that both explains the sensory sequence and also satisfies a set of unity conditions, designed to ensure that the constituents of the theory are connected in a relational structure.<br><br>However, the original formulation of the apperception task had one fundamental limitation: it assumed the raw sensory input had already been parsed using a set of discrete categories, so that all the system had to do was receive this already-digested symbolic input, and make sense of it. But what if we don't have access to pre-parsed input? What if our sensory sequence is raw unprocessed information?<br<br>The central contribution of this paper is a neuro-symbolic framework for distilling interpretable theories out of streams of raw, unprocessed sensory experience. First, we extend the definition of the apperception task to include ambiguous (but still symbolic) input: sequences of sets of disjunctions. Next, we use a neural network to map raw sensory input to disjunctive input. Our binary neural network is encoded as a logic program, so the weights of the network and the rules of the theory can be solved jointly as a single SAT problem. This way, we are able to jointly learn how to perceive (mapping raw sensory information to concepts) and apperceive (combining concepts into declarative rules).",
                "lastest-update": "October 2021",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S0004370221000722",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S0004370221000722/pdfft?md5=1c1af40d88a499b2aa305de762ec629d&pid=1-s2.0-S0004370221000722-main.pdf"
            }
        ]
    },
    {
        "id": "BC",
        "content": [
            {
                "name": "Smart contract-enabled consortium blockchains for the control of supply chain information distortion",
                "author": "Corban Allenbrand",
                "review-article": "Conflicts between supply chain members emerge because individual strategic actions may not be jointly optimal. Efforts to forecast consumer demand represent a source of conflict. The coordination of forecasts requires a powerful incentive alignment approach. This work proposes a smart contract equipped consortium blockchain system that creates an incentive structure that makes coordination with respect to forecasts economically appealing. Distortions of demand information due to uncoordinated forecasting are captured by a bullwhip measure that factors both forecast error and variance. Cooperation under the system is shown to help minimize this bullwhip measure, thus generating new outcomes for the participants that allow for a higher reward. Under a fixed payout structure, the system achieves credibility of continued cooperation, thus promoting an optimally coordinated equilibrium between the retailer and supplier. Blockchain technology represents a novel information system and consensus formation mechanism that can intermediate the behavior of a supply chain network.",
                "lastest-update": "September 2023",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S209672092300009X",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S209672092300009X/pdfft?md5=ab078cb9822def4ce3e78bfea376d128&pid=1-s2.0-S209672092300009X-main.pdf"
            },
            {
                "name": "Blockchain-as-a-Service and Blockchain-as-a-Partner: Implementation options for supply chain optimization",
                "author": "Paolo Bottoni, Claudio Di Ciccio, Remo Pareschi, Domenico Tortola, Nicola Gessa, Gilda Massa",
                "review-article": "Smart contracts show a high potential to make supply chain management strategies epochally leap towards higher levels of productivity, not only in the functioning of production processes but also in terms of product innovation and overall economic returns. This article illustrates the principle of Income Sharing as a highly performing economic strategy for supply chains with a natural implementation in blockchain smart contracts. It proposes a blockchain-based architecture that uses smart contracts to implement various algorithmic versions of the Income Sharing principle among companies participating in a supply chain. The formation of the total income and its consequent redistribution are calculated taking into account the role of the technological platform automating these procedures, which therefore becomes a party to the inter-company business project of a supply chain in the alternative roles, as feasible in business practice, of Blockchain-as-a-Service and Blockchain-as-a-Partner. The approach is implemented on Hyperledger Fabric, the most widespread platform for private and consortium blockchains. We compare and justify this design choice with the alternative given by public blockchains, with specific attention to Ethereum.",
                "lastest-update": "June 2023",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S2096720922000604",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S2096720922000604/pdfft?md5=efb65a0bf2932b6bb26bcb21971ce487&pid=1-s2.0-S2096720922000604-main.pdf"
            },
            {
                "name": "Cheap and secure metatransactions on the blockchain using hash-based authorisation and preferred batchers",
                "author": "William Hughes, Tobias Magnusson,Alejandro Russo, Gerardo Schneider",
                "review-article": "Smart contracts are self-executing programs running in the blockchain allowing for decentralised storage and execution without a middleman. On-chain execution is expensive, with miners charging fees for distributed execution according to a cost model defined in the protocol. In particular, transactions have a high fixed cost.<br><br>We present MultiCall, a transaction-batching interpreter for Ethereum that reduces the cost of smart contract executions by gathering multiple users' transactions into a batch. Our current implementation of MultiCall includes the following features: the ability to emulate Ethereum calls and create transactions, both from MultiCall itself and using an identity unique to the user; the ability to cheaply pay Ether to other MultiCall users; and the ability to authorise emulated transactions on behalf of multiple users in a single transaction using hash-based authorisation rather than more expensive signatures. This improves upon a previous version of MultiCall. Our experiments show that MultiCall provides a saving between 57% and 99% of the fixed transaction cost compared with the standard approach of sending Ethereum transactions directly.<br><br>Besides, we also show how to prevent an economic attack exploiting the metatransaction feature, describe a generic protocol for hash-based authorisation of metatransactions, and analyse how to minimise its off-chain computational and storage cost.",
                "lastest-update": "June 2023",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S2096720922000665",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S2096720922000665/pdfft?md5=31073d1f222f57a02c2044b466c7aa38&pid=1-s2.0-S2096720922000665-main.pdf"
            },
            {
                "name": "Benefits for the bunker industry in adopting blockchain technology for dispute resolution",
                "author": "Daniel Adam, Dante Benjamin Matellini, Anna Kaparaki",
                "review-article": "The bunker industry has faced negative perception to their trust and credibility in recent times. This is further compounded by the need for the industry to answer new challenges to meet the requirement of the International Maritime Organization 2020. The aim of this work is to illustrate how blockchain technology may be adopted for aiding in bunker dispute resolution.<br><br>To demonstrate how blockchain may aid in disputes within the bunker industry, this paper first examines the existing bunker supply process, which involves the formation of contracts under English law, the Bunker Delivery Notes, the different types of disputes that may arise during a bunker transaction and the methods of dispute resolution utilised by the industry. Furthermore, the current literature in relation to blockchain technology and blockchain smart contracts is examined. Finally, interviews and surveys within the industry have been conducted to identify the benefits and challenges in adopting blockchain technology.<br><br>The research found that blockchains may benefit the bunker supply chain offering the effective resolution of bunker quality disputes. Furthermore, blockchains may also serve as a verification tool for electronic bunker delivery notes, which may aid quality and quantity bunker disputes as well as compliance with the new International Maritime Organisation 2020 requirements. As a result, despite the research having shown blockchain to be situationally dependent and having an element of legal uncertainty, blockchain does offer a solution to aid in bunker disputes and for improving the trust and credibility within the bunker industry.",
                "lastest-update": "June 2023",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S2096720923000039",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S2096720923000039/pdfft?md5=7f16fe13838ed65a6ed3064f901b3d42&pid=1-s2.0-S2096720923000039-main.pdf"
            }
        ]
    },
    {
        "id": "BD",
        "content": [
            {
                "name": "Integrating Models and Fusing Data in a Deep Ensemble Learning Method for Predicting Epidemic Diseases Outbreak",
                "author": "Nesrine Ben Yahia, Mohamed Dhiaeddine Kandara, Narjes Bellamine BenSaoud",
                "review-article": "Due to the continuous and growing spread of the novel corona virus (COVID-19) worldwide, it is urgent, especially in the data science era, to develop accurate data driven decision-aided methods to predict and early detect the outbreak of this epidemic disease and then to support healthcare decision makers. In this context, the main goal of this paper is to build an accurate and generic data driven method that can predict daily COVID-19 positive cases and therefore helps stakeholders to make and review their epidemic response plans. This method is based on the integration of three deep learning models: Long Short Term Memory (LSTM), Deep Neural Networks (DNN) and Convolutional Neural Networks (CNN) and takes advantage of their complementarity. The proposed method is validated on two experimental scenarios where the first one aims to validate the method on China and Tunisia case studies and the second one is based on data fusion and transfer learning process where China data and models will be reused to predict Tunisia COVID-19 outbreak. Experiment results indicate that, compared with individual learners, the stacked-DNN meta-learner, whose inputs are results of LSTM, DNN and CNN learners, achieved the best results in terms of accuracy as well as RMSE and it required the lowest time for training as well as prediction for the two scenarios. The main outcomes of this paper are i) to adopt deep learning models combined to stacking ensemble learning to accurately forecast COVID-19 positive cases and ii) to merge data and to adopt transfer learning for the prediction of confirmed cases by reusing China data, learners and meat-learners to make prediction of the epidemic trend for other countries, with less facilities of collecting data, when preventive and control measures are similar.",
                "lastest-update": "February 2022",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S2214579621001039",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S2214579621001039/pdfft?md5=b3c8839aacc09d337e3057dbf0f1adf5&pid=1-s2.0-S2214579621001039-main.pdf"
            },
            {
                "name": "A Flexible Outlier Detector Based on a Topology Given by Graph Communities",
                "author": "Oriol Ramos Terrades, Albert Berenguel, Débora Gil",
                "review-article": "Outlier detection is essential for optimal performance of machine learning methods and statistical predictive models. Their detection is especially determinant in small sample size unbalanced problems, since in such settings outliers become highly influential and significantly bias models. This particular experimental settings are usual in medical applications, like diagnosis of rare pathologies, outcome of experimental personalized treatments or pandemic emergencies. In contrast to population-based methods, neighborhood based local approaches compute an outlier score from the neighbors of each sample, are simple flexible methods that have the potential to perform well in small sample size unbalanced problems. A main concern of local approaches is the impact that the computation of each sample neighborhood has on the method performance. Most approaches use a distance in the feature space to define a single neighborhood that requires careful selection of several parameters, like the number of neighbors.<br><br>This work presents a local approach based on a local measure of the heterogeneity of sample labels in the feature space considered as a topological manifold. Topology is computed using the communities of a weighted graph codifying mutual nearest neighbors in the feature space. This way, we provide with a set of multiple neighborhoods able to describe the structure of complex spaces without parameter fine tuning. The extensive experiments on real-world and synthetic data sets show that our approach outperforms, both, local and global strategies in multi and single view settings.",
                "lastest-update": "August 2022",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S2214579622000260",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S2214579622000260/pdfft?md5=828b70c36d70d2b11889d7a6e572ee0c&pid=1-s2.0-S2214579622000260-main.pdf"
            },
            {
                "name": "Accelerating Columnar Storage Based on Asynchronous Skipping Strategy",
                "author": "Wenhai Li, Zheng Yang, Lingfeng Deng, Zhiling Cheng, Weidong Wen, Yanxiang He",
                "review-article": "Many database applications, such as OnLine Analytical Processing (OLAP), web-based information extraction or scientific computation, need to select a subset of fields based on several user-defined filters. Developers of these applications require effective assembly methods for on-demand filtering and aggregation, which raises new challenges in deploying parallel computing components on top of columnar storage.<br><br>To efficiently generate qualified records, an asynchronous skipping strategy is presented to speed up filtering and decoding in the column-based storage. Concentrating on filtering-pushdown in parallel analytical workloads, we offer in-depth analysis on record assembly. We highlight the bottleneck of traditional record-wise assembling methods in the cases of evaluating analytical tasks on a nested schema. With a concurrent queue structure, an asynchronous skipping strategy is presented to evaluate column scan separately by a software pipeline involving an optionally different set of threads. We show how to intensively read the sequential blocks of each column, and how to effectively eliminate invalid payloads by integrating filtering-pushdown in an asynchronous I/O stack.<br><br>We implement a columnar storage supporting filtering-pushdown in nested schema. Our experiments are conducted on a de-facto standard benchmark using both variant-selectivity scans and ad-hoc queries. The results revealed that in parallel I/O-intensive workloads, our implementation improved the I/O performance of the state-of-the arts by 1.3X~2.7X. Coupling the asynchronous strategy with filtering-pushdown, our implementation remarkably outperforms its competitors with heavyweight coding workloads on both HDD and SSD.",
                "lastest-update": "February 2023",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S2214579622000466",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S2214579622000466/pdfft?md5=48fb5e40b3a5dd6dad23468675f494f6&pid=1-s2.0-S2214579622000466-main.pdf"
            },
            {
                "name": "Properties and Performance of the ABCDe Random Graph Model with Community Structure",
                "author": "Bogumił Kamiński, Tomasz Olczak, Bartosz Pankratz, Paweł Prałat, François Théberge",
                "review-article": "In this paper, we investigate properties and performance of synthetic random graph models with a built-in community structure. Such models are important for evaluating and tuning community detection algorithms that are unsupervised by nature. We propose </span><strong>ABCDe</strong>—a multi-threaded implementation of the <strong>ABCD</strong> (Artificial Benchmark for Community Detection) graph generator. We discuss the implementation details of the algorithm and compare it with both the previously available sequential version of the <strong>ABCD</strong> model and with the parallel implementation of the standard and extensively used <strong>LFR</strong> (Lancichinetti–Fortunato–Radicchi) generator. We show that <strong>ABCDe</strong> is more than ten times faster and scales better than the parallel implementation of <strong>LFR</strong> provided in NetworKit. Moreover, the algorithm is not only faster but random graphs generated by <strong>ABCD</strong> have similar properties to the ones generated by the original <strong>LFR</strong> algorithm, while the parallelized NetworKit implementation of <strong>LFR</strong> produces graphs that have noticeably different characteristics.",
                "lastest-update": "November 2022",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S2214579622000429",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S2214579622000429/pdfft?md5=5b249e2f347f9c9eeb348b655a88cf99&pid=1-s2.0-S2214579622000429-main.pdf"
            }
        ]
    },
    {
        "id": "VR",
        "content": [
            {
                "name": "A Spatiotemporal Intelligent Framework and Experimental Platform for Urban Digital Twins",
                "author": "Jinxing Hu, Zhihan Lv, Diping Yuan, Bing He, Wenjiang Chen, Xiongfei Ye, Donghao Li, Ge Yang",
                "review-article": "This work emphasizes the current research status of the urban Digital Twins to establish an intelligent spatiotemporal framework. A Geospatial Artificial Intelligent (GeoAI) system is developed based on the Geographic Information System and Artificial Intelligence. It integrates multi-video technology and Virtual City in urban Digital Twins. Besides, an improved small object detection model is proposed: YOLOv5-Pyramid, and Siamese network video tracking models, namely MPSiam and FSSiamese, are established. Finally, an experimental platform is built to verify the georeferencing correction scheme of video images. The experimental results show that the Multiply-Accumulate value of MPSiam is 0.5B, and that of ResNet50-Siam is 4.5B. Besides, the model is compressed by 4.8 times. The inference speed has increased by 3.3 times, reaching 83 Frames Per Second. 3% of the Average Expectation Overlap is lost. Therefore, the urban Digital Twins-oriented GeoAI framework established here has excellent performance for video georeferencing and target detection problems.",
                "lastest-update": "June 2023",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S2096579622000936",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S2096579622000936/pdf?md5=aeaf272e13a33cd943f2d24a2bd21f2e&pid=1-s2.0-S2096579622000936-main.pdf"
            },
            {
                "name": "AR-Assisted Children Book For Smart Teaching And Learning Of Turkish Alphabets",
                "author": "Ahmed L. Alyousify, Ramadhan J. Mstafa",
                "review-article": "Augmented reality (AR), virtual reality (VR), and remote-controlled devices are driving the need for a better 5G infrastructure to support faster data transmission. This paper emphasizes that mobile AR is a viable and widespread solution that can easily scale to millions of end-users and educators since it is lightweight, low-cost, and cross-platform. Low-efficiency smart devices and lengthy latency for real-time interactions via regular mobile networks are major barriers to using AR in education. The good news is that the upcoming 5G cellular networks can mitigate some of these issues via network slicing, device-to-device communication, and mobile edge computing. In this paper, we rely on technology to solve some of these problems. The proposed software monitors Image Targets on a printed book and renders 3D objects and alphabet models. In addition, the application considers phonetics. The sound (Phonetic) and 3D representation of the letter are played as soon as an image target is detected. The Turkish alphabet 3D models were created in Adobe Photoshop using Unity3D and the Vuforia SDK. The proposed application teaches Turkish alphabets and phonetics by using 3D object models, 3D letters, and 3D phrases including those letters and sounds.",
                "lastest-update": "June 2022",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S2096579622000432",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S2096579622000432/pdf?md5=69d83e6557b258f371ddc091f0376da6&pid=1-s2.0-S2096579622000432-main.pdf"
            },
            {
                "name": "Virtual Reality for Immersive Multi-User Firefighter Training Scenarios",
                "author": "Philipp Braun, Michaela Grafelmann, Felix Gill, Hauke Stolz, Johannes Hinckeldeyn, Ann-Kathrin Lange",
                "review-article": "Virtual Reality (VR) applications are tools used to provide comprehensive training scenarios that are difficult or impossible to represent in physical configurations. This includes team training for emergency services, e.g. in firefighting. To achieve effective virtual training, creating a high level of immersion is essential. In that respect, motion capture systems offer the possibility to create highly immersive multi-user training experiences including full-body avatars. This work presents a preliminary prototype that enables the extinguishing of a fire on a container ship as a VR training scenario. The prototype provides a full-body and multi-user VR experience, based on the synthesis of position data provided by the motion capture system and orientation data from the VR headsets. As a consequence, the prototype allows an initial evaluation of results. The results confirm the value of using VR to train procedures that are difficult to train in the real world. Furthermore, the results show that motion capture based VR technologies are particularly useful for firefighting training, in which participants can collaborate in otherwise difficult-to-access environments. However, the work also illustrates that increasing the immersion of such training remains a challenge.",
                "lastest-update": "October 2022",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S209657962200081X",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S209657962200081X/pdf?md5=1287c6b99ffe058108e336cc8bf7aca8&pid=1-s2.0-S209657962200081X-main.pdf"
            },
            {
                "name": "Urban 3D modeling with mobile laser scanning: a review",
                "author": "Cheng Wang, Chenglu Wen, Yudi Dai, Shangshu Yu, Minghao Liu",
                "review-article": "Mobile laser scanning (MLS) systems mainly comprise laser scanners and mobile mapping platforms. Typical MLS systems are able to acquire three-dimensional point clouds with 1-10 centimeter point spacing at a normal driving or walking speed in the street or indoor environments. The MLS' advantages of efficiency and stability make it a quite practical tool for three-dimensional urban modeling. This paper reviews the latest advances in 3D modeling of the LiDAR-based mobile mapping system (MMS) point cloud, including LiDAR Simultaneous Localization and Mapping (SLAM), point cloud registration, feature extraction, object extraction, semantic segmentation, and deep learning processing. Then typical urban modeling applications based on MMS are also discussed.",
                "lastest-update": "June 2020",
                "research-link": "https://www.sciencedirect.com/science/article/pii/S2096579620300395",
                "pdf": "https://www.sciencedirect.com/science/article/pii/S2096579620300395/pdf?md5=9666c474ffe9eca21d4d1bda33cc3ccc&pid=1-s2.0-S2096579620300395-main.pdf"
            }
        ]
    }
]