{
    "researchs":[
        {
            "name": "Smart contract-enabled consortium blockchains for the control of supply chain information distortion",
            "author":"Corban Allenbrand",
            "review-article":"Conflicts between supply chain members emerge because individual strategic actions may not be jointly optimal. Efforts to forecast consumer demand represent a source of conflict. The coordination of forecasts requires a powerful incentive alignment approach. This work proposes a smart contract equipped consortium blockchain system that creates an incentive structure that makes coordination with respect to forecasts economically appealing. Distortions of demand information due to uncoordinated forecasting are captured by a bullwhip measure that factors both forecast error and variance. Cooperation under the system is shown to help minimize this bullwhip measure, thus generating new outcomes for the participants that allow for a higher reward. Under a fixed payout structure, the system achieves credibility of continued cooperation, thus promoting an optimally coordinated equilibrium between the retailer and supplier. Blockchain technology represents a novel information system and consensus formation mechanism that can intermediate the behavior of a supply chain network.",
            "lastest-update":"September 2023",
            "research-link":"https://www.sciencedirect.com/science/article/pii/S209672092300009X",
            "pdf":"https://www.sciencedirect.com/science/article/pii/S209672092300009X/pdfft?md5=ab078cb9822def4ce3e78bfea376d128&pid=1-s2.0-S209672092300009X-main.pdf"
        },
        {
            "name": "Blockchain-as-a-Service and Blockchain-as-a-Partner: Implementation options for supply chain optimization",
            "author":"Paolo Bottoni, Claudio Di Ciccio, Remo Pareschi, Domenico Tortola, Nicola Gessa, Gilda Massa",
            "review-article":"Smart contracts show a high potential to make supply chain management strategies epochally leap towards higher levels of productivity, not only in the functioning of production processes but also in terms of product innovation and overall economic returns. This article illustrates the principle of Income Sharing as a highly performing economic strategy for supply chains with a natural implementation in blockchain smart contracts. It proposes a blockchain-based architecture that uses smart contracts to implement various algorithmic versions of the Income Sharing principle among companies participating in a supply chain. The formation of the total income and its consequent redistribution are calculated taking into account the role of the technological platform automating these procedures, which therefore becomes a party to the inter-company business project of a supply chain in the alternative roles, as feasible in business practice, of Blockchain-as-a-Service and Blockchain-as-a-Partner. The approach is implemented on Hyperledger Fabric, the most widespread platform for private and consortium blockchains. We compare and justify this design choice with the alternative given by public blockchains, with specific attention to Ethereum.",
            "lastest-update":"June 2023",
            "research-link":"https://www.sciencedirect.com/science/article/pii/S2096720922000604",
            "pdf":"https://www.sciencedirect.com/science/article/pii/S2096720922000604/pdfft?md5=efb65a0bf2932b6bb26bcb21971ce487&pid=1-s2.0-S2096720922000604-main.pdf"
        },
        {
            "name": "Cheap and secure metatransactions on the blockchain using hash-based authorisation and preferred batchers",
            "author":"William Hughes, Tobias Magnusson,Alejandro Russo, Gerardo Schneider",
            "review-article":"Smart contracts are self-executing programs running in the blockchain allowing for decentralised storage and execution without a middleman. On-chain execution is expensive, with miners charging fees for distributed execution according to a cost model defined in the protocol. In particular, transactions have a high fixed cost.<br><br>We present MultiCall, a transaction-batching interpreter for Ethereum that reduces the cost of smart contract executions by gathering multiple users' transactions into a batch. Our current implementation of MultiCall includes the following features: the ability to emulate Ethereum calls and create transactions, both from MultiCall itself and using an identity unique to the user; the ability to cheaply pay Ether to other MultiCall users; and the ability to authorise emulated transactions on behalf of multiple users in a single transaction using hash-based authorisation rather than more expensive signatures. This improves upon a previous version of MultiCall. Our experiments show that MultiCall provides a saving between 57% and 99% of the fixed transaction cost compared with the standard approach of sending Ethereum transactions directly.<br><br>Besides, we also show how to prevent an economic attack exploiting the metatransaction feature, describe a generic protocol for hash-based authorisation of metatransactions, and analyse how to minimise its off-chain computational and storage cost.",
            "lastest-update":"June 2023",
            "research-link":"https://www.sciencedirect.com/science/article/pii/S2096720922000665",
            "pdf":"https://www.sciencedirect.com/science/article/pii/S2096720922000665/pdfft?md5=31073d1f222f57a02c2044b466c7aa38&pid=1-s2.0-S2096720922000665-main.pdf"
        },
        {
            "name": "Benefits for the bunker industry in adopting blockchain technology for dispute resolution",
            "author":"Daniel Adam, Dante Benjamin Matellini, Anna Kaparaki",
            "review-article":"The bunker industry has faced negative perception to their trust and credibility in recent times. This is further compounded by the need for the industry to answer new challenges to meet the requirement of the International Maritime Organization 2020. The aim of this work is to illustrate how blockchain technology may be adopted for aiding in bunker dispute resolution.<br><br>To demonstrate how blockchain may aid in disputes within the bunker industry, this paper first examines the existing bunker supply process, which involves the formation of contracts under English law, the Bunker Delivery Notes, the different types of disputes that may arise during a bunker transaction and the methods of dispute resolution utilised by the industry. Furthermore, the current literature in relation to blockchain technology and blockchain smart contracts is examined. Finally, interviews and surveys within the industry have been conducted to identify the benefits and challenges in adopting blockchain technology.<br><br>The research found that blockchains may benefit the bunker supply chain offering the effective resolution of bunker quality disputes. Furthermore, blockchains may also serve as a verification tool for electronic bunker delivery notes, which may aid quality and quantity bunker disputes as well as compliance with the new International Maritime Organisation 2020 requirements. As a result, despite the research having shown blockchain to be situationally dependent and having an element of legal uncertainty, blockchain does offer a solution to aid in bunker disputes and for improving the trust and credibility within the bunker industry.",
            "lastest-update":"June 2023",
            "research-link":"https://www.sciencedirect.com/science/article/pii/S2096720923000039",
            "pdf":"https://www.sciencedirect.com/science/article/pii/S2096720923000039/pdfft?md5=7f16fe13838ed65a6ed3064f901b3d42&pid=1-s2.0-S2096720923000039-main.pdf"
        }
    ]
}