{
    "researchs":[
        {
            "name": "Integrating Models and Fusing Data in a Deep Ensemble Learning Method for Predicting Epidemic Diseases Outbreak",
            "author":"Nesrine Ben Yahia, Mohamed Dhiaeddine Kandara, Narjes Bellamine BenSaoud",
            "review-article":"Due to the continuous and growing spread of the novel corona virus (COVID-19) worldwide, it is urgent, especially in the data science era, to develop accurate data driven decision-aided methods to predict and early detect the outbreak of this epidemic disease and then to support healthcare decision makers. In this context, the main goal of this paper is to build an accurate and generic data driven method that can predict daily COVID-19 positive cases and therefore helps stakeholders to make and review their epidemic response plans. This method is based on the integration of three deep learning models: Long Short Term Memory (LSTM), Deep Neural Networks (DNN) and Convolutional Neural Networks (CNN) and takes advantage of their complementarity. The proposed method is validated on two experimental scenarios where the first one aims to validate the method on China and Tunisia case studies and the second one is based on data fusion and transfer learning process where China data and models will be reused to predict Tunisia COVID-19 outbreak. Experiment results indicate that, compared with individual learners, the stacked-DNN meta-learner, whose inputs are results of LSTM, DNN and CNN learners, achieved the best results in terms of accuracy as well as RMSE and it required the lowest time for training as well as prediction for the two scenarios. The main outcomes of this paper are i) to adopt deep learning models combined to stacking ensemble learning to accurately forecast COVID-19 positive cases and ii) to merge data and to adopt transfer learning for the prediction of confirmed cases by reusing China data, learners and meat-learners to make prediction of the epidemic trend for other countries, with less facilities of collecting data, when preventive and control measures are similar.",
            "lastest-update":"February 2022",
            "research-link":"https://www.sciencedirect.com/science/article/pii/S2214579621001039",
            "pdf":"https://www.sciencedirect.com/science/article/pii/S2214579621001039/pdfft?md5=b3c8839aacc09d337e3057dbf0f1adf5&pid=1-s2.0-S2214579621001039-main.pdf"
        },
        {
            "name": "A Flexible Outlier Detector Based on a Topology Given by Graph Communities",
            "author":"Oriol Ramos Terrades, Albert Berenguel, Débora Gil",
            "review-article":"Outlier detection is essential for optimal performance of machine learning methods and statistical predictive models. Their detection is especially determinant in small sample size unbalanced problems, since in such settings outliers become highly influential and significantly bias models. This particular experimental settings are usual in medical applications, like diagnosis of rare pathologies, outcome of experimental personalized treatments or pandemic emergencies. In contrast to population-based methods, neighborhood based local approaches compute an outlier score from the neighbors of each sample, are simple flexible methods that have the potential to perform well in small sample size unbalanced problems. A main concern of local approaches is the impact that the computation of each sample neighborhood has on the method performance. Most approaches use a distance in the feature space to define a single neighborhood that requires careful selection of several parameters, like the number of neighbors.<br><br>This work presents a local approach based on a local measure of the heterogeneity of sample labels in the feature space considered as a topological manifold. Topology is computed using the communities of a weighted graph codifying mutual nearest neighbors in the feature space. This way, we provide with a set of multiple neighborhoods able to describe the structure of complex spaces without parameter fine tuning. The extensive experiments on real-world and synthetic data sets show that our approach outperforms, both, local and global strategies in multi and single view settings.",
            "lastest-update":"August 2022",
            "research-link":"https://www.sciencedirect.com/science/article/pii/S2214579622000260",
            "pdf":"https://www.sciencedirect.com/science/article/pii/S2214579622000260/pdfft?md5=828b70c36d70d2b11889d7a6e572ee0c&pid=1-s2.0-S2214579622000260-main.pdf"
        },
        {
            "name": "Accelerating Columnar Storage Based on Asynchronous Skipping Strategy",
            "author":"Wenhai Li, Zheng Yang, Lingfeng Deng, Zhiling Cheng, Weidong Wen, Yanxiang He",
            "review-article":"Many database applications, such as OnLine Analytical Processing (OLAP), web-based information extraction or scientific computation, need to select a subset of fields based on several user-defined filters. Developers of these applications require effective assembly methods for on-demand filtering and aggregation, which raises new challenges in deploying parallel computing components on top of columnar storage.<br><br>To efficiently generate qualified records, an asynchronous skipping strategy is presented to speed up filtering and decoding in the column-based storage. Concentrating on filtering-pushdown in parallel analytical workloads, we offer in-depth analysis on record assembly. We highlight the bottleneck of traditional record-wise assembling methods in the cases of evaluating analytical tasks on a nested schema. With a concurrent queue structure, an asynchronous skipping strategy is presented to evaluate column scan separately by a software pipeline involving an optionally different set of threads. We show how to intensively read the sequential blocks of each column, and how to effectively eliminate invalid payloads by integrating filtering-pushdown in an asynchronous I/O stack.<br><br>We implement a columnar storage supporting filtering-pushdown in nested schema. Our experiments are conducted on a de-facto standard benchmark using both variant-selectivity scans and ad-hoc queries. The results revealed that in parallel I/O-intensive workloads, our implementation improved the I/O performance of the state-of-the arts by 1.3X~2.7X. Coupling the asynchronous strategy with filtering-pushdown, our implementation remarkably outperforms its competitors with heavyweight coding workloads on both HDD and SSD.",
            "lastest-update":"February 2023",
            "research-link":"https://www.sciencedirect.com/science/article/pii/S2214579622000466",
            "pdf":"https://www.sciencedirect.com/science/article/pii/S2214579622000466/pdfft?md5=48fb5e40b3a5dd6dad23468675f494f6&pid=1-s2.0-S2214579622000466-main.pdf"
        },
        {
            "name": "Properties and Performance of the ABCDe Random Graph Model with Community Structure",
            "author":"Bogumił Kamiński, Tomasz Olczak, Bartosz Pankratz, Paweł Prałat, François Théberge",
            "review-article":"In this paper, we investigate properties and performance of synthetic random graph models with a built-in community structure. Such models are important for evaluating and tuning community detection algorithms that are unsupervised by nature. We propose </span><strong>ABCDe</strong>—a multi-threaded implementation of the <strong>ABCD</strong> (Artificial Benchmark for Community Detection) graph generator. We discuss the implementation details of the algorithm and compare it with both the previously available sequential version of the <strong>ABCD</strong> model and with the parallel implementation of the standard and extensively used <strong>LFR</strong> (Lancichinetti–Fortunato–Radicchi) generator. We show that <strong>ABCDe</strong> is more than ten times faster and scales better than the parallel implementation of <strong>LFR</strong> provided in NetworKit. Moreover, the algorithm is not only faster but random graphs generated by <strong>ABCD</strong> have similar properties to the ones generated by the original <strong>LFR</strong> algorithm, while the parallelized NetworKit implementation of <strong>LFR</strong> produces graphs that have noticeably different characteristics.",
            "lastest-update":"November 2022",
            "research-link":"https://www.sciencedirect.com/science/article/pii/S2214579622000429",
            "pdf":"https://www.sciencedirect.com/science/article/pii/S2214579622000429/pdfft?md5=5b249e2f347f9c9eeb348b655a88cf99&pid=1-s2.0-S2214579622000429-main.pdf"
        }
    ]
}