{
    "researchs":[
        {
            "name": "A Spatiotemporal Intelligent Framework and Experimental Platform for Urban Digital Twins",
            "author":"Jinxing Hu, Zhihan Lv, Diping Yuan, Bing He, Wenjiang Chen, Xiongfei Ye, Donghao Li, Ge Yang",
            "review-article":"This work emphasizes the current research status of the urban Digital Twins to establish an intelligent spatiotemporal framework. A Geospatial Artificial Intelligent (GeoAI) system is developed based on the Geographic Information System and Artificial Intelligence. It integrates multi-video technology and Virtual City in urban Digital Twins. Besides, an improved small object detection model is proposed: YOLOv5-Pyramid, and Siamese network video tracking models, namely MPSiam and FSSiamese, are established. Finally, an experimental platform is built to verify the georeferencing correction scheme of video images. The experimental results show that the Multiply-Accumulate value of MPSiam is 0.5B, and that of ResNet50-Siam is 4.5B. Besides, the model is compressed by 4.8 times. The inference speed has increased by 3.3 times, reaching 83 Frames Per Second. 3% of the Average Expectation Overlap is lost. Therefore, the urban Digital Twins-oriented GeoAI framework established here has excellent performance for video georeferencing and target detection problems.",
            "lastest-update":"June 2023",
            "research-link":"https://www.sciencedirect.com/science/article/pii/S2096579622000936",
            "pdf":"https://www.sciencedirect.com/science/article/pii/S2096579622000936/pdf?md5=aeaf272e13a33cd943f2d24a2bd21f2e&pid=1-s2.0-S2096579622000936-main.pdf"
        },
        {
            "name": "AR-Assisted Children Book For Smart Teaching And Learning Of Turkish Alphabets",
            "author":"Ahmed L. Alyousify, Ramadhan J. Mstafa",
            "review-article":"Augmented reality (AR), virtual reality (VR), and remote-controlled devices are driving the need for a better 5G infrastructure to support faster data transmission. This paper emphasizes that mobile AR is a viable and widespread solution that can easily scale to millions of end-users and educators since it is lightweight, low-cost, and cross-platform. Low-efficiency smart devices and lengthy latency for real-time interactions via regular mobile networks are major barriers to using AR in education. The good news is that the upcoming 5G cellular networks can mitigate some of these issues via network slicing, device-to-device communication, and mobile edge computing. In this paper, we rely on technology to solve some of these problems. The proposed software monitors Image Targets on a printed book and renders 3D objects and alphabet models. In addition, the application considers phonetics. The sound (Phonetic) and 3D representation of the letter are played as soon as an image target is detected. The Turkish alphabet 3D models were created in Adobe Photoshop using Unity3D and the Vuforia SDK. The proposed application teaches Turkish alphabets and phonetics by using 3D object models, 3D letters, and 3D phrases including those letters and sounds.",
            "lastest-update":"June 2022",
            "research-link":"https://www.sciencedirect.com/science/article/pii/S2096579622000432",
            "pdf":"https://www.sciencedirect.com/science/article/pii/S2096579622000432/pdf?md5=69d83e6557b258f371ddc091f0376da6&pid=1-s2.0-S2096579622000432-main.pdf"
        },
        {
            "name": "Virtual Reality for Immersive Multi-User Firefighter Training Scenarios",
            "author":"Philipp Braun, Michaela Grafelmann, Felix Gill, Hauke Stolz, Johannes Hinckeldeyn, Ann-Kathrin Lange",
            "review-article":"Virtual Reality (VR) applications are tools used to provide comprehensive training scenarios that are difficult or impossible to represent in physical configurations. This includes team training for emergency services, e.g. in firefighting. To achieve effective virtual training, creating a high level of immersion is essential. In that respect, motion capture systems offer the possibility to create highly immersive multi-user training experiences including full-body avatars. This work presents a preliminary prototype that enables the extinguishing of a fire on a container ship as a VR training scenario. The prototype provides a full-body and multi-user VR experience, based on the synthesis of position data provided by the motion capture system and orientation data from the VR headsets. As a consequence, the prototype allows an initial evaluation of results. The results confirm the value of using VR to train procedures that are difficult to train in the real world. Furthermore, the results show that motion capture based VR technologies are particularly useful for firefighting training, in which participants can collaborate in otherwise difficult-to-access environments. However, the work also illustrates that increasing the immersion of such training remains a challenge.",
            "lastest-update":"October 2022",
            "research-link":"https://www.sciencedirect.com/science/article/pii/S209657962200081X",
            "pdf":"https://www.sciencedirect.com/science/article/pii/S209657962200081X/pdf?md5=1287c6b99ffe058108e336cc8bf7aca8&pid=1-s2.0-S209657962200081X-main.pdf"
        },
        {
            "name": "Urban 3D modeling with mobile laser scanning: a review",
            "author":"Cheng Wang, Chenglu Wen, Yudi Dai, Shangshu Yu, Minghao Liu",
            "review-article":"Mobile laser scanning (MLS) systems mainly comprise laser scanners and mobile mapping platforms. Typical MLS systems are able to acquire three-dimensional point clouds with 1-10 centimeter point spacing at a normal driving or walking speed in the street or indoor environments. The MLS' advantages of efficiency and stability make it a quite practical tool for three-dimensional urban modeling. This paper reviews the latest advances in 3D modeling of the LiDAR-based mobile mapping system (MMS) point cloud, including LiDAR Simultaneous Localization and Mapping (SLAM), point cloud registration, feature extraction, object extraction, semantic segmentation, and deep learning processing. Then typical urban modeling applications based on MMS are also discussed.",
            "lastest-update":"June 2020",
            "research-link":"https://www.sciencedirect.com/science/article/pii/S2096579620300395",
            "pdf":"https://www.sciencedirect.com/science/article/pii/S2096579620300395/pdf?md5=9666c474ffe9eca21d4d1bda33cc3ccc&pid=1-s2.0-S2096579620300395-main.pdf"
        }
    ]
}